#! /usr/bin/python3
# -*- coding: utf-8 -*-

import re
import cgi

form = cgi.FieldStorage()
query = form.getvalue('query')


def main(query):
    print("Content-type:text/html\r\n\r\n")

    abbr_list = [
    'АПК', 'ААЭП', 'АДМ', 'АОЭФ', 'АПК', 'АТБ', 'АТС', 'АХЧ', 'БЗ', 'БСМП', 'БТИ', 'БУ', 'ВВК', 'ВДНХ', 'ВИС', 'ВИЧ', 'ВК', 'ВКР', 'ВНЖ', 'ВСК', 'ВСП', 'ВТБ', 'ВУ', 'ВУЗ', 'ВЭМЗ', 'ГАИ', 'ГБО', 'ГЖС', 'ГИБДД', 'ГИТ', 'ГК', 'ГПД', 'ГПК', 'ГРУ', 'ГСЖ', 'ГСК', 'ГТИ', 'ДДУ', 'ДКП', 'ДНК', 'ДНР', 'ДПС', 'ДТВ', 'ДТП', 'ДЦП', 'ДЮСШ', 'ЕГРЮЛ', 'ЕГЭ', 'ЕДВ', 'ЕДК', 'ЕНВД', 'ЖД', 'ЖЖ', 'ЖК', 'ЖКО', 'ЖКУ', 'ЖКХ', 'ЖСК', 'ЖЭК', 'ЖЭУ', 'ЗАГС', 'ЗАО', 'ЗОП', 'ЗП', 'ИЖС', 'ИНН', 'ИП', 'ИФНС', 'ИЦЭУ', 'КАСКО', 'КВЭД', 'КДН', 'КЖД', 'КЗОТ', 'КОАП', 'КФХ', 'КЭМЗ', 'ЛБГ', 'ЛПХ', 'МАИ', 'МВД', 'МВТ', 'МКД', 'МКНЦ', 'МО', 'МРОТ', 'МСЭ', 'МСЭК', 'МТС', 'МФО', 'МФЦ', 'МЧС', 'НДС', 'НДФЛ', 'НСО', 'НТВ', 'НФП', 'ОАО', 'ОБЭП', 'ОКВЭД', 'Онлайн', 'ООО', 'ОПГ', 'ОСАГО', 'ПВУ', 'ПГС', 'ПДД', 'ПДЗ', 'ПМЖ', 'ПМР', 'ПНВД', 'ППС', 'ППФ', 'ПСК', 'ПСМ', 'ПТС', 'ПФ', 'ПФР', 'РБ', 'РВП', 'РЖД', 'Росреестр', 'РФ', 'СанПиН', 'САО', 'СДТ', 'СИД', 'СИЗО', 'СК', 'СМС', 'СМЭ', 'СНТ', 'СПО', 'СРО', 'ССП', 'СССР', 'ССУЗ', 'СТО', 'США', 'СЭД', 'ТД', 'ТК', 'ТНА', 'ТС', 'ТСД', 'ТСЖ', 'ТСН', 'УДО', 'УИИ', 'УК', 'УПК', 'УТС', 'УТС', 'УФМС', 'УФСИН', 'ФГБУ', 'ФГУП', 'ФЗ', 'ФИО', 'ФМС', 'ФНС', 'Форекс', 'ФРС', 'ФС', 'ФСБ', 'ФСИН', 'ФСП', 'ФССП', 'ФСФР', 'ФТС', 'ЦАФАП', 'ЦБ', 'ЦЗ', 'ЦЗН', 'ЧОП', 'ЧП', 'ЧПУ', 'ЧР', 'ЧС', 'ЧТЗ', 'ЭВМ', 'ЭДО', 'Ютуб', 'Email',
    ]

    for abbr in abbr_list:
        pattern = re.compile(r"\b%s\b" % abbr.lower())
        result = re.search(pattern, query)
        if result:
            query = re.sub(pattern, abbr, query)
    print (query)

if __name__ == '__main__':
    main(query)
